app/views/listing/index.html.erb


    <% @user.sneakers.each do |sneaker| %>
---
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."user_id" = $1  [["user_id", 4]]