app/views/wishlist/index.html.erb

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]
---
<% @wishlist_items.each do |item|%>
<% sneaker = Sneaker.find(item.sneaker_id)%>