app/controllers/listing_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def index
        @user = User.find(params[:id])

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 134], ["LIMIT", 1]]
DELETE FROM "sneakers" WHERE "sneakers"."id" = $1  [["id", 134]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 18]]
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."sneaker_id" = $1  [["sneaker_id", 122]]
DELETE FROM "sneakers" WHERE "sneakers"."id" = $1  [["id", 120]]
---
    def destroy
        user = current_user
        item_id = Sneaker.find(params[:id])
        Wishlist.where(sneaker_id: params[:id]).destroy_all
        item_id.destroy