app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
class MessagesController < ApplicationController
    before_action do
        @conversation = Conversation.find(params[:conversation_id])

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 1]]
---
    def index
      @messages = @conversation.messages
        if @messages.length > 10

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello is this working?"], ["conversation_id", 1], ["user_id", 8], ["created_at", "2020-03-07 05:30:34.892845"], ["updated_at", "2020-03-07 05:30:34.892845"]]
---
        def create
        @message = @conversation.messages.new(message_params)
            if @message.save