app/controllers/sneaker_controller.rb

SELECT "sneakers".* FROM "sneakers" WHERE (LOWER(model) LIKE '%yezy%')
---
    def index
        @sneaker = Sneaker.search(params[:search])

INSERT INTO "sneakers" ("model", "size", "price", "created_at", "updated_at", "brand", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["model", "Air force 1 "], ["size", 7], ["price", "100.0"], ["created_at", "2020-03-05 06:47:08.050953"], ["updated_at", "2020-03-05 06:47:08.050953"], ["brand", "Nike"], ["user_id", 8]]
UPDATE "sneakers" SET "updated_at" = $1 WHERE "sneakers"."id" = $2  [["updated_at", "2020-03-05 06:47:08.376756"], ["id", 122]]
---
    def sell
        user = current_user
        @sneaker = user.sneakers.create(
            brand: params[:sneaker][:brand],
            model: params[:sneaker][:model],
            price: params[:sneaker][:price],
            size: params[:sneaker][:size],
        )
        @sneaker.picture.attach(params[:sneaker][:picture])

        if @sneaker.valid? && @sneaker.save

SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
---
    def show
        @sneaker = Sneaker.find(params[:id])
        @user = User.find(@sneaker.user_id)