app/controllers/user_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "email" = $3, "location" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["first_name", "Adam"], ["last_name", "H"], ["email", "a.hyde@gmail.com"], ["location", "Brisbane, QLD"], ["updated_at", "2020-03-06 01:49:44.503021"], ["id", 7]]
---
    def update
        profile = current_user
        profile.update(
            first_name: params[:first_name],
            last_name: params[:last_name],
            email: params[:email],
            location: params[:location],
            contact: params[:contact]
        )