app/controllers/wishlist_controller.rb

INSERT INTO "wishlists" ("user_id", "sneaker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["sneaker_id", 117], ["created_at", "2020-03-06 05:59:27.904659"], ["updated_at", "2020-03-06 05:59:27.904659"]]
---
    def add
        user = current_user

        item = user.wishlists.create(
            sneaker_id: params[:id]
        )

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1 AND "wishlists"."sneaker_id" = $2 ORDER BY "wishlists"."id" ASC LIMIT $3  [["user_id", 4], ["sneaker_id", 121], ["LIMIT", 1]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 9]]
---
    def destroy
        user = current_user
        wishlist = user.wishlists
        item_id = wishlist.where(sneaker_id: params[:id]).first
        item_id.destroy