app/models/sneaker.rb

    def self.search(search)
        if search
            result = self.where("LOWER(brand) LIKE ?", "%#{search.downcase}%")
            if result.length > 0
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."brand" = $1 LIMIT $2  [["brand", "Nike"], ["LIMIT", 1]]
SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."brand" = $1  [["brand", "Adidas"]]